{"backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"use_bias": true, "activation": "tanh", "kernel_size": [3, 3], "padding": "same", "return_state": false, "return_sequences": true, "trainable": true, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dtype": "float32", "activity_regularizer": null, "filters": 32, "strides": [1, 1], "data_format": "channels_last", "name": "conv_lst_m2d_1", "dilation_rate": [1, 1], "recurrent_regularizer": null, "unroll": false, "unit_forget_bias": true, "batch_input_shape": [null, null, 250, 360, 3], "bias_regularizer": null, "bias_constraint": null, "recurrent_dropout": 0.0, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_constraint": null}, "class_name": "ConvLSTM2D"}, {"config": {"name": "batch_normalization_1", "epsilon": 0.001, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.25, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "activation": "tanh", "kernel_size": [3, 3], "recurrent_regularizer": null, "return_state": false, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "name": "conv_lst_m2d_2", "go_backwards": false, "activity_regularizer": null, "filters": 32, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "padding": "same", "unroll": false, "unit_forget_bias": true, "bias_regularizer": null, "trainable": true, "recurrent_dropout": 0.0, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_constraint": null}, "class_name": "ConvLSTM2D"}, {"config": {"name": "batch_normalization_2", "epsilon": 0.001, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.25, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"strides": [1, 1, 1], "use_bias": true, "data_format": "channels_last", "name": "conv3d_1", "dilation_rate": [1, 1, 1], "padding": "same", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "activity_regularizer": null, "filters": 3, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3, 3], "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv3D"}]}, "class_name": "Sequential", "keras_version": "2.2.4"}